-- 1. 실습 시나리오

CREATE TABLE employee_project (
    emp_id INT,
    emp_name VARCHAR(30),
    phone_numbers VARCHAR(100),
    project_id INT,
    project_name VARCHAR(50),
    dept_code CHAR(2),
    dept_name VARCHAR(30),
    PRIMARY KEY(emp_id, project_id)
);

INSERT INTO employee_project
VALUES
(1001,'홍길동','010-1111-1111,010-9999-9999',101,'쇼핑몰 구축','D1','개발부'),
(1001,'홍길동','010-1111-1111,010-9999-9999',102,'ERP 구축','D1','개발부'),
(1001,'홍길동','010-1111-1111,010-9999-9999',103,'모바일 앱','D1','개발부'),
(1002,'김철수','010-2222-2222',101,'쇼핑몰 구축','D2','영업부'),
(1002,'김철수','010-2222-2222',104,'CRM 구축','D2','영업부'),
(1003,'이영희','010-3333-3333',103,'모바일 앱','D1','개발부'),
(1003,'이영희','010-3333-3333',105,'AI 챗봇','D1','개발부'),
(1004,'박민수','010-4444-4444',102,'ERP 구축','D3','인사부'),
(1004,'박민수','010-4444-4444',106,'전자결재','D3','인사부'),
(1005,'최지훈','010-5555-5555,010-8888-8888',101,'쇼핑몰 구축','D2','영업부'),
(1005,'최지훈','010-5555-5555,010-8888-8888',107,'데이터웨어하우스','D2','영업부'),
(1006,'한소영','010-6666-6666',105,'AI 챗봇','D1','개발부'),
(1006,'한소영','010-6666-6666',108,'클라우드 전환','D1','개발부'),
(1007,'정우성','010-7777-7777',104,'CRM 구축','D4','마케팅부'),
(1007,'정우성','010-7777-7777',109,'홈페이지 리뉴얼','D4','마케팅부'),
(1008,'오세훈','010-8888-1111',106,'전자결재','D3','인사부'),
(1008,'오세훈','010-8888-1111',108,'클라우드 전환','D3','인사부'),
(1009,'강민지','010-9999-2222',107,'데이터웨어하우스','D5','전략기획부'),
(1010,'윤성호','010-1234-5678',109,'홈페이지 리뉴얼','D4','마케팅부'),
(1010,'윤성호','010-1234-5678',105,'AI 챗봇','D4','마케팅부');

SELECT * FROM employee_project;

-- 2. 문제점을 찾아 1NF → 2NF → 3NF로 개선하다.

-- 1) 이 테이블에서 발생하는 수정 이상을 2가지 설명하시오.
-- 한 컬럼에 두개의 값 -> 중복 발생
-- 기본키(복합키)가 아닌 일반 컬럼에서 부분적으로 함수 종속됨

-- 2) 삽입 이상이 발생하는 이유를 설명하시오. 
-- 하나의 컬럼에는 하나의 값만 저장해야 하므로

-- 3) 삭제 이상이 발생하는 예를 작성하시오. 
DELETE FROM employee_project
WHERE emp_id = 1001
	AND dept_code= 'D1';
-- emp_id가 1001인 행에서 부서 코드만 삭제했을 뿐인데, 퇴사 처리가 되어버린다. 

-- 4) 1정규형으로 변경하여 DDL을 작성하시오. 
CREATE TABLE employee_project1 (
    emp_id INT,
    emp_name VARCHAR(30),
    project_id INT,
    project_name VARCHAR(50),
    dept_code CHAR(2),
    dept_name VARCHAR(30),
    PRIMARY KEY(emp_id, project_id)
);

CREATE TABLE employee_phone (
	emp_id INT,
    phone_number VARCHAR(100),
    PRIMARY KEY(emp_id, phone_number)
);

INSERT INTO employee_project1
VALUES
(1001,'홍길동',101,'쇼핑몰 구축','D1','개발부'),
(1001,'홍길동',102,'ERP 구축','D1','개발부'),
(1001,'홍길동',103,'모바일 앱','D1','개발부'),
(1002,'김철수',101,'쇼핑몰 구축','D2','영업부'),
(1002,'김철수',104,'CRM 구축','D2','영업부'),
(1003,'이영희',103,'모바일 앱','D1','개발부'),
(1003,'이영희',105,'AI 챗봇','D1','개발부'),
(1004,'박민수',102,'ERP 구축','D3','인사부'),
(1004,'박민수',106,'전자결재','D3','인사부'),
(1005,'최지훈',101,'쇼핑몰 구축','D2','영업부'),
(1005,'최지훈',107,'데이터웨어하우스','D2','영업부'),
(1006,'한소영',105,'AI 챗봇','D1','개발부'),
(1006,'한소영',108,'클라우드 전환','D1','개발부'),
(1007,'정우성',104,'CRM 구축','D4','마케팅부'),
(1007,'정우성',109,'홈페이지 리뉴얼','D4','마케팅부'),
(1008,'오세훈',106,'전자결재','D3','인사부'),
(1008,'오세훈',108,'클라우드 전환','D3','인사부'),
(1009,'강민지',107,'데이터웨어하우스','D5','전략기획부'),
(1010,'윤성호',109,'홈페이지 리뉴얼','D4','마케팅부'),
(1010,'윤성호',105,'AI 챗봇','D4','마케팅부');

INSERT INTO employee_phone
VALUES
(1001, '010-1111-1111'),
(1001, '010-9999-9999'),
(1002, '010-2222-2222'),
(1003, '010-3333-3333'),
(1004, '010-4444-4444'),
(1005, '010-5555-5555'),
(1005, '010-8888-8888'),
(1006, '010-6666-6666'),
(1007, '010-7777-7777'),
(1008, '010-8888-1111'),
(1009, '010-9999-2222'),
(1010, '010-1234-5678');

SELECT * FROM employee_project1;
SELECT * FROM employee_phone;


-- 5) 2정규형으로 변경하여 DDL과 ERD를 작성하시오. 
CREATE TABLE emp_id_master (
	emp_id INT PRIMARY KEY,
    emp_name VARCHAR(30)
);
INSERT INTO emp_id_master 
VALUES
(1001,'홍길동'),
(1002,'김철수'),
(1003,'이영희'),
(1004,'박민수'),
(1005,'최지훈'),
(1006,'한소영'),
(1007,'정우성'),
(1008,'오세훈'),
(1009,'강민지'),
(1010,'윤성호');

CREATE TABLE project_id_master (
	project_id INT PRIMARY KEY,
    project_name VARCHAR(30)
);
INSERT INTO project_id_master
VALUES
(101,'쇼핑몰 구축'),
(102,'ERP 구축'),
(103,'모바일 앱'),
(104,'CRM 구축'),
(105,'AI 챗봇'),
(106,'전자결재'),
(107,'데이터웨어하우스'),
(108,'클라우드 전환'),
(109,'홈페이지 리뉴얼');

CREATE TABLE dept_code_master (
	dept_code CHAR(2) PRIMARY KEY,
    dept_name VARCHAR(30)
);
INSERT INTO dept_code_master
VALUES
('D1','개발부'),
('D2','영업부'),
('D3','인사부'),
('D4','마케팅부'),
('D5','전략기획부');

SELECT
	